package com.movingkey.android.movingkey.languages;


import com.movingkey.android.movingkey.languages.bean.Language;

import java.util.Arrays;

/**
 * Created by jhkim on 2016. 3. 4..
 */
public class Arabic extends Language
{
    public Arabic()
    {

        this.hwi00_languageName = "Arabic";
        this.hwi00_languageCode = "ar";

        /// 쿼티 QWERTY
        this.hwi01_qwerty01_normalKey = Arrays.asList(

                "ض","ص","ث","ق","ف","غ","ع","ه","خ","ح","ج",
                "ش","س","ي","ب","ل","ا","ت","ن","م","ك","ة",
                "shift" ,"ظ","ط","ذ","د","ز","ر","و","ى", "del",
                "emoticon", "global", "space", "enter"
        );

        this.hwi01_qwerty02_normalKey_shift = Arrays.asList(
                "ض","ص","ث","ق","ف","غ","ع","ه","خ","ح","ج",
                "ش","س","ي","ب","ل","ا","ت","ن","م","ك","ة",
                "shift","ظ","ط","ذ","د","ز","ر","و","ى","del",
                "emoticon","global","space","enter"
        );



        this.hwi01_qwerty03_smallText = Arrays.asList(

                "١","٢","٣","٤","٥","٦","٧","٨","٩","٠","﷼",
                "ُٰ","َ","ّ","ڤ","آ","إ","أ","هـ","ک","گ","چ",
                "ٌ","ْ","ً","پ","لا","ژ","","ؤ","ئ","ٓ","ٰ",
                "ِ","ـ","ٍ","ء","\"",".","،","؟","!",":",

                "⚙","★","lang01","lang02","★"
        );

        this.hwi01_qwerty04_smallText_shift = Arrays.asList(

                ":-)",":-(",";-)",":'(",":-D",":-O",">:-O",":-P",":-*",":-|",":-$",
                "ُٰ","َ","ّ","ڤ","آ","إ","أ","هـ","ک","گ","چ",
                "ٌ","ْ","ً","پ","لا","ژ","","ؤ","ئ","ٓ","ٰ",
                "ـ","ٍ","ء","",".","،","؟","!",":",
                "⚙","★","lang01","lang02","★"
        );







        /// 하프쿼티 Half QWERTY
        this.hwi02_halfQwerty01_normalKey = Arrays.asList(
                "ثص",	"فق",	"عغ",	"خه",	"جح",
                "يس",	"لب",	"تا",	"من",	"ةك",
                "shift","طظ",	"دذ",	"رز","del",
                "emoticon","global","space","enter"
        );

        this.hwi02_halfQwerty02_normalKey_shift= Arrays.asList(
                "ثص",	"فق",	"عغ",	"خه",	"جح",
                "يس",	"لب",	"تا",	"من",	"ةك",
                "shift","طظ",	"دذ",	"رز","del",
                "emoticon","global","space","enter"
        );

        this.hwi02_halfQwerty03_smallText = Arrays.asList(
                "١",           "٢",   "٣",    "٤",   "٥",   "٦",    "٧",   "٨",    "٩",  "٠",    "﷼",
                "ض",                   "",            "",             "",             "",           "",
                "ُٰ" ,           "َ",  "ّ",    "ڤ",    "آ",   "إ",     "أ",  "هـ",   "",  "گ",   "چ",
                "ش",                    "",             "",            "",             "",          "" ,
                "ٌ" ,           "ْ",    "ً",    "پ",    "لا",   "ژ",     "",    "ؤ",    "ئ",   "ٓ",   "ٰ ",
                "ء",                     "",             "",            "",             "و",          "ى",
                "ِ",           "ـ",     "ٍ",    "!",    "؟",  ".",     "،",   ":",     "؛",   "",    "",

                "⚙","★","lang01","lang02","★"
        );

        this.hwi02_halfQwerty04_smallText_shift = Arrays.asList(
                "١",           "٢",   "٣",    "٤",   "٥",   "٦",    "٧",   "٨",    "٩",  "٠",    "﷼",
                "ض",                   "",            "",             "",             "",           "",
                "ُٰ" ,           "َ",    "ّ",    "ڤ",    "آ",   "إ",     "أ",   "هـ",     "",  "گ",   "چ",
                "ش",                    "",             "",            "",             "",          "" ,
                "ٌ" ,           "ْ",    "ً",    "پ",    "لا",   "ژ",     "",    "ؤ",    "ئ",   "ٓ",   "ٰ ",
                "ء",                     "",             "",            "",             "و",          "ى",
                "ِ",           "ـ",     "ٍ",    "!",    "؟",  ".",     "،",   ":",     "؛",   "",    "",
                "⚙","★","lang01","lang02","★"
        );








        /// 케토  QETUO
        this.hwi03_qetuo01_normalKey = Arrays.asList(

                "ص",   "ق",   "غ",    "ه",    "ح",
                "س",   "ب",    "ا",    "ن",    "ك",
                "shift","ط",    "د",    "ر","del",
                "emoticon","global","space","enter"
        );


        this.hwi03_qetuo02_normalKey_shift = Arrays.asList(
                "ص",	"ق",	"غ",	"ه",	"ح",
                "س",	"ب",	"ا",	"ن",	"ك",
                "shift","ط",	"د",	"ر","del",
                "emoticon","global","space","enter"
        );


        this.hwi03_qetuo03_smallText = Arrays.asList(
                "١",           "٢",   "٣",   "٤",   "٥",    "٦",    "٧",   "٨",    "٩",  "٠",    "﷼",
                "ض",                  "ث",           "ف",           "ع",            "خ",          "ج",
                "ُٰ" ,          "َ",    "ّ",    "ڤ",    "آ",   "إ",     "أ",   "هـ",     "",   "گ",   "چ",
                "ش",                    "ي",            "ل",           "ت",            "م",          "ة",
                "ٌ" ,           "ْ",    "ً",    "پ",    "لا",   "ژ",     "",    "ؤ",    "ئ",   "ٓ",   "ٰ ",
                "ء",                    "ظ",            "ذ",           "ز",            "و",          "ى",
                "ِ",           "ـ",     "ٍ",     "!",    "؟",  ".",     "،",   ":",     "؛",   "",   "",


                "⚙","★","lang01","lang02","★"
        );

        this.hwi03_qetuo04_smallText_shift = Arrays.asList(
                "" ,           "1",   "2",   "3",   "4",   "5",   "6",    "7",   "8",    "9",  "0",
                "ض",                  "ث",           "ف",           "ع",            "خ",          "ج",
                "ُٰ" ,         "َ",    "ّ",    "ڤ",    "آ",   "إ",     "أ",   "هـ",     "",   "گ",   "چ",
                "ش",                   "ي",            "ل",           "ت",            "م",          "ة",
                "ٌ" ,           "ْ",    "ً",    "پ",    "لا",   "ژ",     "",    "ؤ",    "ئ",   "ٓ",   "ٰ ",
                "ء",                    "ظ",            "ذ",           "ز",            "و",          "ى",
                "ِ",           "ـ",     "ٍ",     "!",    "؟",  ".",     "،",   ":",     "؛",   "",   "",

                "⚙","★","lang01","lang02","★"
        );
    }
}
